emacs/.config/jmacs/jmacs.org
#+title: Jmacs
#+subtitle: Jacob's Literate Emacs Config
#+author: Jacob Hilker
#+startup: fold
#+property: header-args:elisp :tangle jmacs.el 
#+property: header-args:emacs-lisp :tangle jmacs.el 


* Initialization
** Early Initialization
:properties:
:header-args:elisp: :tangle early-init.el
:end:
*** Disabling Package.el 
By default, I want to use straight.el as my package manager.
#+begin_src elisp
(setq package-enable-at-startup nil)
#+end_src

*** UTF-8
I want UTF-8 characters for my files.
#+begin_src elisp
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-language-environment 'utf-8)
(set-selection-coding-system 'utf-8)
(set-default buffer-file-coding-system 'utf-8)
#+end_src

** General Initialization
:properties:
:header-args:elisp: :tangle init.el :lexical t
:end:
*** Lexical Binding and Unicode
This is the header-line for my =init.el=. It just sets unicode and lexical binding.
#+begin_src elisp
;;; init.el --- -*- lexical-binding: t; coding: utf-8; -*-
#+end_src


*** Setting Up Straight.el
I am using straight.el for my packages.
#+begin_src elisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
      (with-current-buffer
              (url-retrieve-synchronously
                       "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
                                'silent 'inhibit-cookies)
                    (goto-char (point-max))
                          (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

*** Setting Up Use-Package with Straight.el
Use-package provides an easy-to-use macro - I like that, but want the functionality of straight.el.
#+begin_src elisp
(straight-use-package 'use-package)
#+end_src

And finally, I always want it to use straight.el.
#+begin_src elisp
(setq straight-use-package-by-default t)
#+end_src

*** Performance Improvements
*** UI Setup
**** Cleaner Title Format
#+begin_src elisp
(setq frame-title-format '("Emacs - %b@" (:eval (or (file-remote-p default-directory 'host) system-name))))
#+end_src


**** Minimal UI
I really hate seeing the menu bar, scrollbar, etc. I'm disabling those items here.
#+begin_src elisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(menu-bar-mode -1)
#+end_src

**** Theme
***** Doom Themes
Doom Themes is a nice collection of themes for emacs. I am using the Doom-one theme, based one the OneDark colors in Atom.


#+begin_src elisp
(use-package doom-themes
  :config
    (setq doom-themes-enable-bold t
            doom-themes-enable-italic t)
      (load-theme 'doom-gruvbox t))
#+end_src

**** Fonts

#+begin_src elisp
(defun jh/set-fonts ()
  (set-face-attribute 'default nil :font (font-spec :family "Iosevka Nerd Font" :size 14)) 
  (set-face-attribute 'fixed-pitch nil :font (font-spec :family "Iosevka Nerd Font" :size 14)) 
  (set-face-attribute 'variable-pitch nil :font (font-spec :family "Iosevka Aile" :size 12))
  (set-face-attribute 'font-lock-comment-face nil :slant 'italic))
#+end_src

**** Battery and Time
I want to see battery and time in my modeline.
***** Packages
#+begin_src elisp
(use-package battery :ensure nil :straight nil)
#+end_src

***** Formats
#+begin_src elisp
(setq display-time-default-load-average nil
      display-time-mail-string ""
      display-time-format "%a, %d %b - %R")
#+end_src


***** Functions
#+begin_src elisp
(defun jh/battery-time-modeline ()
"Toggles Display of battery and clock in modeline."
(when (and battery-status-function
       (not (string-match-p "N/A" 
                (battery-format "%B"
                        (funcall battery-status-function)))))
  (display-battery-mode 1)
  (display-time-mode 1)))

(add-hook 'after-init-hook #'jh/battery-time-modeline)
#+end_src

**** Server Setup 
I primarily use emacs as a daemon instead of the full application. Here is where I add the fonts for when I run it as a daemon.
#+begin_src elisp
(if (daemonp) 
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                ;; (setq doom-modeline-icon t)
                (with-selected-frame frame
                  (jh/set-fonts))))
    (jh/set-fonts))
#+end_src

*** Org Mode
I want to use the newest version of org-mode instead of the one built in to emacs.
#+begin_src elisp
  (straight-use-package '(org :type git
       :repo "https://code.orgmode.org/bzg/org-mode.git"
       :local-repo "org"
       :depth full
       :pre-build (straight-recipes-org-elpa--build)
       :build (:not autoloads)
       :files (:defaults "lisp/*.el" ("etc/styles/" "etc/styles/*"))))
(straight-use-package '(org-contrib))

#+end_src

And finally, I want to load my config.
#+begin_src elisp
  (org-babel-load-file (expand-file-name "jmacs.org" user-emacs-directory))
#+end_src





* Initial Setup
** Lexical Binding and Unicode
Once again, this just sets up unicode encoding and lexical binding.
#+begin_src elisp
;;; -*- lexical-binding: t; coding: utf-8; -*- 
#+end_src

** Personal Information
  This is where I setup my initial personal information, as well as a minimal UI and enabling the visual bell. I'm also setting up emacs to use it's own customize file instead of =init.el=. It will only load if that file exists.
#+begin_src elisp
(setq user-full-name "Jacob Hilker"
      user-mail-address "jacob.hilker2@gmail.com"
      visible-bell t)

(setq-default custom-file (expand-file-name ".custom.el" user-emacs-directory))
#+end_src


* Minor Tweaks
** Making =TAB= Great Again
*** Disabling Automatic Tabs
I am disabling automatic indentation with electric-indent-mode, and disabling tabs.
#+begin_src elisp
(electric-indent-mode -1)
(setq-default indent-tabs-mode nil)
(setq tab-always-indent 'complete)
#+end_src

*** Improving Tab Key Functionality
I want to use 2 spaces for tabs for 99% of the languages I use. In addition, I want source blocks in org-mode to keep my regular indentation.
#+begin_src emacs-lisp
(setq org-src-preserve-indentation t
      org-src-fontify-natively t
      org-src-tab-acts-natively t)

(setq-default tab-width 2)
#+end_src


** Y/N for Yes/No
I also want to use y/n for answering yes or no.
#+begin_src elisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Scratch Buffer Uses Org Mode
I want my scratch buffer to use org-mode. I also want no message for my scratch buffer.
#+begin_src elisp
(setq initial-major-mode 'org-mode)
#+end_src

** Icons
I want to use icons occasionally. Might not be very often, but sometimes it's nice to have.
#+begin_src elisp
(use-package all-the-icons
    :if (display-graphic-p))
#+end_src

** Emoji
Sometimes I want to add an emoji.
#+begin_src elisp
(use-package emojify)
#+end_src

* Core Functionality
** Packages
*** Undo Tree                                                         
Undo Tree lets me use more of Evil mode's redo functionality.
#+begin_src elisp
(use-package undo-tree
  :config
  (global-undo-tree-mode))
#+end_src

*** Evil Mode
Evil mode lets me use the (superior) Vim bindings to the Emacs ones. In addition, I don't want :q to kill emacs, but rather the current buffer I am in (similar to Vim).
**** Evil-mode Core
This is the core of evil mode.
#+begin_src elisp
(use-package evil
  :init
  (setq evil-undo-system 'undo-tree)
  (setq evil-want-C-i-jump nil) 
  (setq evil-want-C-u-scroll t)
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1)
  :preface
  (defun ian/save-and-kill-this-buffer ()
    (interactive)
    (save-buffer)
    (kill-this-buffer))
  :config
  (with-eval-after-load 'evil-maps ; avoid conflict with company tooltip selection
    (define-key evil-insert-state-map (kbd "C-n") nil)
    (define-key evil-insert-state-map (kbd "C-p") nil))
  (evil-ex-define-cmd "q" #'kill-this-buffer)
  (evil-ex-define-cmd "wq" #'ian/save-and-kill-this-buffer))
#+end_src

**** Evil-mode Collection
This provides a collection of modules for using evil mode in other emacs programs.
#+begin_src elisp
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

**** Evil Org-Mode
#+begin_src elisp
(use-package evil-org
  :after org
  :init
  (fset 'evil-redirect-digit-argument 'ignore) ; before evil-org loaded
  (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
  (evil-define-key 'motion 'evil-org-mode
    (kbd "0") 'evil-org-beginning-of-line)
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

#+end_src

**** Evil Surround
#+begin_src elisp
(use-package evil-surround
  :hook (evil-mode . global-evil-surround-mode))
#+end_src


*** General
#+begin_src elisp
(use-package general)
#+end_src

*** Which-Key
Which-key lets me see what keybindings I can use.
#+begin_src elisp
(use-package which-key
  :config
  (which-key-mode 1))
#+end_src


*** Helpful
Helpful allows me to have a better view of a help buffer.
#+begin_src elisp
(use-package helpful)
#+end_src

*** Treemacs
Treemacs allows me to set up a sidebar with project information.
#+begin_src elisp
(use-package treemacs
  :config
  (setq treemacs-persist-file "~/.emacs.d/.local/cache/treemacs.org"))

(use-package treemacs-evil
  :after evil treemacs
  :ensure t)

(use-package treemacs-projectile
  :after projectile treemacs
  :ensure t)

(use-package treemacs-magit
  :after magit treemacs
  :ensure t)
#+end_src

*** Imenu-List
Imenu-list lets me look at the file as a list.
#+begin_src elisp
(use-package imenu-list)
#+end_src

*** Restart Emacs
#+begin_src elisp
(use-package restart-emacs)
#+end_src

*** YASnippet
YASnippet allows me to quickly insert snippets.
#+begin_src elisp
(use-package yasnippet
  :hook (after-init . yas-global-mode))

(use-package yasnippet-snippets
  :after yasnippet)
#+end_src

*** Pass
#+begin_src elisp
(use-package pass
  :config
  (setf epa-pinentry-mode 'loopback))
  #+end_src

*** Company
For all my in-buffer completion needs.
#+begin_src elisp
(use-package company
  :hook (after-init . global-company-mode))
#+end_src

* Completion Frameworks
