emacs/.config/jmacs/jmacs.el
;;; -*- lexical-binding: t; coding: utf-8; -*-

(setq user-full-name "Jacob Hilker"
      user-mail-address "jacob.hilker2@gmail.com"
      visible-bell t)

(setq-default custom-file (expand-file-name ".custom.el" user-emacs-directory))

(electric-indent-mode -1)
(setq-default indent-tabs-mode nil)
(setq tab-always-indent 'complete)

(setq org-src-preserve-indentation t
      org-src-fontify-natively t
      org-src-tab-acts-natively t)

(setq-default tab-width 2)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq initial-major-mode 'org-mode)

(use-package all-the-icons
    :if (display-graphic-p))

(use-package emojify)

(use-package undo-tree
  :config
  (global-undo-tree-mode))

(use-package evil
  :init
  (setq evil-undo-system 'undo-tree)
  (setq evil-want-C-i-jump nil) 
  (setq evil-want-C-u-scroll t)
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-want-keybinding nil)
  :config
  (evil-mode 1)
  :preface
  (defun ian/save-and-kill-this-buffer ()
    (interactive)
    (save-buffer)
    (kill-this-buffer))
  :config
  (with-eval-after-load 'evil-maps ; avoid conflict with company tooltip selection
    (define-key evil-insert-state-map (kbd "C-n") nil)
    (define-key evil-insert-state-map (kbd "C-p") nil))
  (evil-ex-define-cmd "q" #'kill-this-buffer)
  (evil-ex-define-cmd "wq" #'ian/save-and-kill-this-buffer))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil-org
  :after org
  :init
  (fset 'evil-redirect-digit-argument 'ignore) ; before evil-org loaded
  (add-to-list 'evil-digit-bound-motions 'evil-org-beginning-of-line)
  (evil-define-key 'motion 'evil-org-mode
    (kbd "0") 'evil-org-beginning-of-line)
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package evil-surround
  :hook (evil-mode . global-evil-surround-mode))

(use-package general)

(use-package which-key
  :config
  (which-key-mode 1))

(use-package helpful)

(use-package treemacs
  :config
  (setq treemacs-persist-file "~/.emacs.d/.local/cache/treemacs.org"))

(use-package treemacs-evil
  :after evil treemacs
  :ensure t)

(use-package treemacs-projectile
  :after projectile treemacs
  :ensure t)

(use-package treemacs-magit
  :after magit treemacs
  :ensure t)

(use-package imenu-list)

(use-package restart-emacs)

(use-package yasnippet
  :hook (after-init . yas-global-mode))

(use-package yasnippet-snippets
  :after yasnippet)

(use-package pass
  :config
  (setf epa-pinentry-mode 'loopback))

(use-package company
  :hook (after-init . global-company-mode))

(use-package vertico
  :ensure t
