emacs/.config/jmacs/jmacs.org
** Vertico, Consult, etc.

#+begin_src elisp
(use-package vertico
  :ensure t
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous)
              ("?" . minibuffer-completion-help)
              ("M-RET" . minibuffer-force-complete-and-exit)
              ("M-TAB" . minibuffer-complete)
              :map minibuffer-local-map
              ("M-h" . backward-kill-word))
  :config
  (setq vertico-cycle t
        vertico-count-format '(" -6%s " . "%s/%s"))
  :init
  (vertico-mode 1))
#+end_src


*** Related Packages
**** Vertico-Posframe
Vertico Posframe allows me to display my completions and such in a posframe.
#+begin_src elisp
(use-package vertico-posframe
  :after vertico
  :straight (:host github :repo "tumashu/vertico-posframe")
  :config
  (vertico-posframe-mode 1))
#+end_src

*** Consult
Consult provides similar commands to Ivy.
#+begin_src elisp
(use-package consult
  :demand t
  :bind (("C-s" . consult-line)
         ("C-M-l" . consult-imenu)
         ("C-M-j" . persp-switch-to-buffer*)
         :map minibuffer-local-map
         ("C-r" . consult-history))
  :custom
  (completion-in-region-function #'consult-completion-in-region))
#+end_src

*** Marginalia
Marginalia is similar to =ivy-rich=, and allows me to see more information about something in a minibuffer (e.g. the helpstring for a function when I hit =M-x=.
#+begin_src elisp
(use-package marginalia
  :after vertico
  :straight t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))
#+end_src

*** Embark
Embark allows me to run actions on completions.
#+begin_src elisp
(use-package embark
    :bind (("C-S-a" . embark-act)
         :map minibuffer-local-map
         ("C-d" . embark-act))
  :config
  (setq embark-action-indicator
        (lambda (map)
          (which-key--show-keymap "Embark" map nil nil 'no-paging)
          #'which-key--hide-popup-ignore-command)
        embark-become-indicator embark-action-indicator))
#+end_src

*** Orderless
Orderless improves candidate filtering.
#+begin_src elisp
(use-package orderless
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

* Command Wrappers
This section defines what I like to call "command wrappers" - things such as Hydra, Embark, and Transient, where I can wrap multiple commands in one minibuffer and execute them.
** Hydra
I want to use hydras for certain things - namely, elfeed filters.
#+begin_src elisp
(use-package hydra)
#+end_src

*** Related Packages
**** Major Mode Hydra
This lets me define hydras for each major mode.
#+begin_src elisp
(use-package major-mode-hydra
:after hydra
:bind ("M-SPC" . major-mode-hydra))
#+end_src

**** Hydra Posframe
Shows hydras in a posframe.
#+begin_src elisp
(use-package hydra-posframe
  :straight (:host github :repo "Ladicle/hydra-posframe")
  :hook (after-init . hydra-posframe-enable))
#+end_src

*** TODO UI Improvements
I want to be able to use icons in my hydra titles.
**** Icon Setup
#+begin_src elisp
(defun with-faicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-faicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-fileicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-fileicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-octicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-octicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-material (icon str &optional height v-adjust)
  (s-concat (all-the-icons-material icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-mode-icon (mode str &optional height nospace face)
  (let* ((v-adjust (if (eq major-mode 'emacs-lisp-mode) 0.0 0.05))
         (args     `(:height ,(or height 1) :v-adjust ,v-adjust))
         (_         (when face
                      (lax-plist-put args :face face)))
         (icon     (apply #'all-the-icons-icon-for-mode mode args))
         (icon     (if (symbolp icon)
                       (apply #'all-the-icons-octicon "file-text" args)
                     icon)))
    (s-concat icon (if nospace "" " ") str)))
#+end_src

**** Title Format
Since major-mode-hydra allows me to use better titles, I have a particular format I want to use - an icon plus the title itself.
#+begin_src elisp
(defvar jh/hydra-title nil "Title format for my major-mode hydras.")
#+end_src

** Transient
A similar package to Hydra, I like to use both. I'm still currently learning this, though.
#+begin_src elisp
(use-package transient)
#+end_src

** Hercules
A which-key based Hydra wrapper.
#+begin_src elisp
(use-package hercules)
#+end_src

* Org Mode
Org-Mode is THE absolute best thing about Emacs, in my humble opinion. Being able to keep notes and an agenda in the same file is so much easier than something like Notion which is pretty resource-intensive and is much harder to organize (in my opinion, at least). I highly respect what they are doing, but I prefer org-mode. My workflow is very much still in progress - for now, it’s sort of a mix of GTD and my own thing. It will probably be constantly changing until I find what works for me.
** Initial Setup
This is my basic setup for org-mode. Nothing with agenda files, just setting up logging and my base org-directory, along with links.
#+begin_src elisp
(setq org-directory "~/Dropbox/org"
      org-log-into-drawer t
      org-log-done 'time
      org-log-done-with-time t
      org-agenda-start-day "-0d"
       org-link-abbrev-alist    ; This overwrites the default Doom org-link-abbrev-list
      '(("google" . "http://www.google.com/search?q=")
        ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
        ("ddg" . "https://duckduckgo.com/?q=")
        ("wiki" . "https://en.wikipedia.org/wiki/")
        ("github" . "https://github.com/")
        ("gitlab" . "https://gitlab.com/")))
#+end_src


*** Core Packages
**** Org-ID
Org-ID allows me to set IDs for different headlines in an org-mode buffer.
#+begin_src elisp
(use-package org-id
  :ensure nil
  :straight nil)
#+end_src

**** Org-Tempo
Org Tempo lets me use <key(tab) to insert blocks into an org-mode document. As an example, I could use <s(tab) to insert a source code block.
#+begin_src emacs-lisp
(use-package org-tempo
  :straight nil
  :ensure nil)
#+end_src

** UI Tweaks
This is a very basic function that sets up org-mode to use visual line mode, org-indent mode, and variable-pitch mode - just a few minor ui tweaks. It doesn't set anything other than that.
#+begin_src elisp
(defun jh/org-ui-init ()
  "Sets better defaults for org-mode ui."
  (visual-line-mode 1)
  (org-indent-mode 1)
  (variable-pitch-mode 1)
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)

  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-document-title nil :font (font-spec :family "Iosevka Aile" :size 25) :weight 'bold)
  (set-face-attribute 'org-tag nil :foreground "#e5c07b")
  (set-face-attribute 'org-hide nil :inherit 'fixed-pitch))


(add-hook 'org-mode-hook #'jh/org-ui-init)
#+end_src

*** Cleaner View
I want to hide formatting characters (like forward-slashes for italics and asterisks for bold, as an example) and any leading stars for a nested heading (like a second-level header under a first-level heading). In addition, I want to use an arrow as my ellipsis, instead of the default three periods.
#+begin_src elisp
(setq org-hide-emphasis-markers t
      org-hide-leading-stars t
      org-ellipsis "▾ ")
#+end_src

*** Packages
**** Org Appear
This package makes it much easier to edit Org documents when org-hide-emphasis-markers is turned on. It temporarily shows the emphasis markers around certain markup elements when you place your cursor inside of them. No more fumbling around with = and * characters! (description credit to [[https://config.daviwil.com/emacs][David Wilson]] of the [[https://youtube.com/c/SystemCrafters][System Crafters]] youtube channel).
#+begin_src elisp
(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t
        org-appear-autosubmarkers t
        org-appear-autoentities t))
#+end_src

**** Org-Fragtog
Org-Fragtog allows me to toggle previews of $\LaTeX$  and other things. I am also setting up org-mode to use slightly bigger LaTeX previews.
#+begin_src elisp
(use-package org-fragtog 
  :hook (org-mode . org-fragtog-mode))

(plist-put org-format-latex-options :scale 1.25)
#+end_src

**** Org-Superstar
Org-superstar lets me get better bullets in my headings and lists.
#+begin_src elisp
(use-package org-superstar
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("●" "○")
        org-superstar-special-todo-items t
        org-superstar-todo-bullet-alist '(("TODO" . ?☐)
                                          ("DONE" . ?☑))))
#+end_src

** Tasks and Events
*** Packages
**** DOCT
DOCT is an easier way of setting up org-mode capture templates.
#+begin_src elisp
(use-package doct
  :commands (doct doct-add-to))
#+end_src

**** Org Super Agenda
Org Super Agenda allows me to group items in the agenda much more easily than I can by default.
#+begin_src elisp
(use-package org-super-agenda
  :config 
;  (setq org-super-agenda-header-map nil)
  (org-super-agenda-mode 1))

#+end_src

**** Org-QL
Org QL allows me to define queries for org-mode files.
#+begin_src elisp
(use-package org-ql)
#+end_src

**** Org-Gcal

