emacs/.config/jmacs/jmacs.el
  :bind (:map vertico-map
              ("C-j" . vertico-next)
              ("C-k" . vertico-previous)
              ("?" . minibuffer-completion-help)
              ("M-RET" . minibuffer-force-complete-and-exit)
              ("M-TAB" . minibuffer-complete)
              :map minibuffer-local-map
              ("M-h" . backward-kill-word))
  :config
  (setq vertico-cycle t
        vertico-count-format '(" -6%s " . "%s/%s"))
  :init
  (vertico-mode 1))

(use-package vertico-posframe
  :after vertico
  :straight (:host github :repo "tumashu/vertico-posframe")
  :config
  (vertico-posframe-mode 1))

(use-package consult
  :demand t
  :bind (("C-s" . consult-line)
         ("C-M-l" . consult-imenu)
         ("C-M-j" . persp-switch-to-buffer*)
         :map minibuffer-local-map
         ("C-r" . consult-history))
  :custom
  (completion-in-region-function #'consult-completion-in-region))

(use-package marginalia
  :after vertico
  :straight t
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))

(use-package embark
    :bind (("C-S-a" . embark-act)
         :map minibuffer-local-map
         ("C-d" . embark-act))
  :config
  (setq embark-action-indicator
        (lambda (map)
          (which-key--show-keymap "Embark" map nil nil 'no-paging)
          #'which-key--hide-popup-ignore-command)
        embark-become-indicator embark-action-indicator))

(use-package orderless
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles . (partial-completion))))))

(use-package hydra)

(use-package major-mode-hydra
:after hydra
:bind ("M-SPC" . major-mode-hydra))

(use-package hydra-posframe
  :straight (:host github :repo "Ladicle/hydra-posframe")
  :hook (after-init . hydra-posframe-enable))

(defun with-faicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-faicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-fileicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-fileicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-octicon (icon str &optional height v-adjust)
  (s-concat (all-the-icons-octicon icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-material (icon str &optional height v-adjust)
  (s-concat (all-the-icons-material icon :v-adjust (or v-adjust 0) :height (or height 1)) " " str))

(defun with-mode-icon (mode str &optional height nospace face)
  (let* ((v-adjust (if (eq major-mode 'emacs-lisp-mode) 0.0 0.05))
         (args     `(:height ,(or height 1) :v-adjust ,v-adjust))
         (_         (when face
                      (lax-plist-put args :face face)))
         (icon     (apply #'all-the-icons-icon-for-mode mode args))
         (icon     (if (symbolp icon)
                       (apply #'all-the-icons-octicon "file-text" args)
                     icon)))
    (s-concat icon (if nospace "" " ") str)))

(defvar jh/hydra-title nil "Title format for my major-mode hydras.")

(use-package transient)

(use-package hercules)

(setq org-directory "~/Dropbox/org"
      org-log-into-drawer t
      org-log-done 'time
      org-log-done-with-time t
      org-agenda-start-day "-0d"
       org-link-abbrev-alist    ; This overwrites the default Doom org-link-abbrev-list
      '(("google" . "http://www.google.com/search?q=")
        ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
        ("ddg" . "https://duckduckgo.com/?q=")
        ("wiki" . "https://en.wikipedia.org/wiki/")
        ("github" . "https://github.com/")
        ("gitlab" . "https://gitlab.com/")))

(use-package org-id
  :ensure nil
  :straight nil)

(use-package org-tempo
  :straight nil
  :ensure nil)

(defun jh/org-ui-init ()
  "Sets better defaults for org-mode ui."
  (visual-line-mode 1)
  (org-indent-mode 1)
  (variable-pitch-mode 1)
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)

  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-document-title nil :font (font-spec :family "Iosevka Aile" :size 25) :weight 'bold)
  (set-face-attribute 'org-tag nil :foreground "#e5c07b")
  (set-face-attribute 'org-hide nil :inherit 'fixed-pitch))


(add-hook 'org-mode-hook #'jh/org-ui-init)

(setq org-hide-emphasis-markers t
      org-hide-leading-stars t
      org-ellipsis "▾ ")

(use-package org-appear
  :hook (org-mode . org-appear-mode)
  :config
  (setq org-appear-autolinks t
        org-appear-autosubmarkers t
        org-appear-autoentities t))

(use-package org-fragtog 
  :hook (org-mode . org-fragtog-mode))

(plist-put org-format-latex-options :scale 1.25)

(use-package org-superstar
  :hook (org-mode . org-superstar-mode)
  :config
  (setq org-superstar-headline-bullets-list '("●" "○")
        org-superstar-special-todo-items t
        org-superstar-todo-bullet-alist '(("TODO" . ?☐)
                                          ("DONE" . ?☑))))

(use-package doct
  :commands (doct doct-add-to))

(use-package org-super-agenda
  :config 
;  (setq org-super-agenda-header-map nil)
  (org-super-agenda-mode 1))

(use-package org-ql)
