emacs/.config/jmacs/jmacs.org
*** Categories and Tags
I use categories and tags to help me organize my work. Categories are what I use more for a context (such as appointments, projects, etc) and a tag is something more narrow within that project. This is where I define my global tags - such as a personal context, or something for work, or for family. In addition, I also use tags to represent the status of a project, such as whether it’s active, or on the backlog, etc. However, with Org-gcal, I was getting duplicate events, so I am setting up tags to be excluded from inheritance here.
#+begin_src elisp
(defvar jh/org-todo-cal-tags '(
                               ;; Project Contexts
                               (:startgroup)
                               ("@personal" . ?p)
                               ("@work" . ?w)
                               (:endgroup))

"Tags for tasks and calendar items.")
                               

#+end_src

*** Refiling
#+begin_src elisp
(setq org-refile-use-outline-path 'file
      org-outline-path-complete-in-steps nil
      org-refile-targets '((nil :maxlevel . 9)))
#+end_src

#+RESULTS:
: ((nil :maxlevel . 9))


*** Capture Templates
*** Custom Agenda Commmands

** Projects
*** Org-Trello
Org Trello allows me to sync org-mode buffers with trello boards.

** Campaign Manager
I like to use org-mode as an rpg campaign manager and wiki.
*** Packages
**** Decide Mode
Decide mode allows me to roll dice in org-mode.
#+begin_src elisp
(use-package decide)
#+end_src

** Writing
Org mode is also an excellent markup language.
*** Packages
**** Org-Make-TOC
Org-make-toc allows me to make tables-of-contents in org-mode.
#+begin_src elisp
(use-package org-make-toc
  :hook (org-mode . org-make-toc-mode))
#+end_src

**** Org-Ref
Org-ref allows me to build bibliographies with org-mode.
#+begin_src elisp
(use-package org-ref)
#+end_src


*** TODO Custom Writing Mode
I want too set up an application similar to scrivener or ywriter in my emacs config.

** Note-taking with Org-Roam
*** Related Packages
**** Deft 
**** Vulpea
#+begin_src elisp
(use-package vulpea
  :straight (vulpea
             :type git
             :host github
             :repo "d12frosted/vulpea")
  :after (org-roam)
  ;; hook into org-roam-db-autosync-mode you wish to enable
  ;; persistence of meta values (see respective section in README to
  ;; find out what meta means)
  :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable)))
#+end_src

#+RESULTS:
| vulpea-db-autosync-enable |

**** Org-Roam-Bibtex
Allows me to build an annotated bibliography with org-roam.
#+begin_src elisp
(use-package org-roam-bibtex
  :after org-roam)
#+end_src

*** Initial Setup
#+begin_src elisp
(use-package org-roam
	:init
	(setq org-roam-v2-ack t)
  :custom
  (org-roam-db-location "~/Nextcloud/roam/.org-roam.db")
  (org-roam-directory "~/Nextcloud/roam/")
  (org-roam-db-update-method 'immediate)
  (org-roam-file-exclude-regexp "readme")
  (org-roam-completion-everywhere t)
  (org-roam-node-display-template "${namespace:12} ${category:20} ${title:*} ${tags:*}")
	:config 
  (cl-defmethod org-roam-node-namespace ((node org-roam-node))
    "Return the currently set namespace for the NODE."
    (let ((namespace (cdr (assoc-string "NAMESPACE" (org-roam-node-properties node)))))
      (if (string= namespace (file-name-base (org-roam-node-file node)))
          "" ; or return the current title, e.g. (org-roam-node-title node)
        (format "%s" namespace))))


  
 (cl-defmethod org-roam-node-category ((node org-roam-node))
    "Return the currently set category for the NODE."
    (let ((category (cdr (assoc-string "CATEGORY" (org-roam-node-properties node)))))
      (if (string= category (file-name-base (org-roam-node-file node)))
          "" ; or return the current title, e.g. (org-roam-node-title node)
        (format "%s" category))))

  (cl-defmethod org-roam-node-backlinks ((node org-roam-node))
    (let* ((count (car (org-roam-db-query
                        [:select (funcall count source)
                                 :from links
                                 :where (= dest $s1)
                                 :and (= type "id")]
                        (org-roam-node-id node)))))
      (format "[%d]" count)))

  (cl-defmethod org-roam-node-slug ((node org-roam-node))
    "Return the slug of NODE."
    (let ((title (org-roam-node-title node))
          (slug-trim-chars '(;; Combining Diacritical Marks https://www.unicode.org/charts/PDF/U0300.pdf
                             768 ; U+0300 COMBINING GRAVE ACCENT
                             769 ; U+0301 COMBINING ACUTE ACCENT
                             770 ; U+0302 COMBINING CIRCUMFLEX ACCENT
                             771 ; U+0303 COMBINING TILDE
                             772 ; U+0304 COMBINING MACRON
                             774 ; U+0306 COMBINING BREVE
                             775 ; U+0307 COMBINING DOT ABOVE
                             776 ; U+0308 COMBINING DIAERESIS
                             777 ; U+0309 COMBINING HOOK ABOVE
                             778 ; U+030A COMBINING RING ABOVE
                             780 ; U+030C COMBINING CARON
                             795 ; U+031B COMBINING HORN
                             803 ; U+0323 COMBINING DOT BELOW
                             804 ; U+0324 COMBINING DIAERESIS BELOW
                             805 ; U+0325 COMBINING RING BELOW
                             807 ; U+0327 COMBINING CEDILLA
                             813 ; U+032D COMBINING CIRCUMFLEX ACCENT BELOW
                             814 ; U+032E COMBINING BREVE BELOW
                             816 ; U+0330 COMBINING TILDE BELOW
                             817 ; U+0331 COMBINING MACRON BELOW
                             )))
      (cl-flet* ((nonspacing-mark-p (char)
                                    (memq char slug-trim-chars))
                 (strip-nonspacing-marks (s)
                                         (ucs-normalize-NFC-string
                                          (apply #'string (seq-remove #'nonspacing-mark-p
                                                                      (ucs-normalize-NFD-string s)))))
                 (cl-replace (title pair)
                             (replace-regexp-in-string (car pair) (cdr pair) title)))
        (let* ((pairs `(("[^[:alnum:][:digit:]]" . "-") ;; convert anything not alphanumeric
                        ("--*" . "-")                   ;; remove sequential underscores
                        ("^-" . "")                     ;; remove starting underscore
                        ("-$" . "")))                   ;; remove ending underscore
               (slug (-reduce-from #'cl-replace (strip-nonspacing-marks title) pairs)))
          (downcase slug))))))

#+end_src

#+RESULTS:
: t


*** Capture Templates
I like to have multiple capture templates - while most of mine are in Nextcloud, I want to be able to quickly capture my ideas.
#+begin_src elisp

#+end_src

*** Multi-Project Setup
Since I use org-roam for multiple projects, I'd like to have a way to capture to specific projects - such as my blog, website, etc.

** Hacking Org-Mode
*** Org-ML
Similar to Org-Element.
#+begin_src elisp
(use-package org-ml)
#+end_src

** Web Development/Blogging
*** Hugo
Since I build my website with hugo, I want to be able to write in org-mode.
#+begin_src elisp
(use-package ox-hugo
  :ensure t
  :config 
  (setq org-hugo-suppress-lastmod-period 86400.00))
#+end_src

*** Org-Publish
**** Initial Package Setup
#+begin_src elisp
(use-package ox-publish
  :ensure nil
  :straight nil)
#+end_src

**** HTML Templating
I'd like to be able to set up an html template in elisp.
#+begin_src elisp
(use-package pp-html
  :straight (:host github :repo "Kinneyzhang/pp-html"))

(use-package esxml
  :ensure t)

(use-package ox-gemini
  :ensure t)

(use-package htmlize
  :ensure t)

(use-package webfeeder
  :ensure t)

#+end_src

***** Test
#+begin_src elisp
(setq org-html-htmlize-output-type 'css)       
(setq-default org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"~/.emacs.d/stylesheet.css\" />")
#+end_src

**** Org-Special-Block-Extras
This package allows me to define custom blocks in org-mode.
#+begin_src elisp
(use-package org-special-block-extras
  :ensure t
  :hook (org-mode . org-special-block-extras-mode)
  ;; All relevant Lisp functions are prefixed 'o-'; e.g., `o-docs-insert'.
  :custom
    (o-docs-libraries
     '("~/Nextcloud/org/org-special-blocks-docs.org")
     "The places where I keep my ‘#+documentation’"))
#+end_src


*** Weblorg
Weblorg is a way of creating static websites in org-mode.
#+begin_src elisp
(use-package weblorg)
#+end_src

*** Defblog
A wrapper around org-publish.
#+begin_src elisp
;(use-package anaphora)

;(use-package defblog
;  :straight (:host github :repo "jphmrst/defblog"))
#+end_src

** Literate Programming
#+begin_src elisp
(add-hook 'org-src-mode-hook 'display-line-numbers-mode)
(org-babel-do-load-languages
 'org-babel-load-languages
'((emacs-lisp . t)
  (python . t)
  (org . t)
))
#+end_src

#+RESULTS:


** Misc. Packages
*** Org Chef
Org-chef allows me to capture recipes from the internet.
#+begin_src elisp

#+end_src

*** Org-CV
This allows me to use org mode to create a resume. I am using ox-moderncv to build my CV.
#+begin_src elisp
(use-package ox-moderncv
  :straight '(:host gitlab :repo "jhilker/org-cv"))
#+end_src


