emacs/.config/jmacs/jmacs.org
** Hydra
This hydra is a wrapper around some of the functions I most commonly use.
#+begin_src elisp
(add-hook 'org-mode-hook (lambda ()
                           (setq jh/hydra-title (with-fileicon "org" "Org-mode" 1 -0.05))))

(major-mode-hydra-define org-mode (:title jh/hydra-title)
  ("Agenda"
   (("aa" org-agenda "Agenda Dispatch"))
   "Dates"
   (("dd" org-deadline "Set Deadline")
    ("ds" org-schedule "Set Scheduled Date")
    ("dt" org-time-stamp "Set Time Stamp"))))
#+end_src

* General IDE Configuration
** General Configuration
I want to highlight todo keywords in all my programming files.
#+begin_src elisp
(defun jh/ide-init ()
  "Initializes Emacs for when I am programming."
  (interactive)
  (global-hl-todo-mode 1)
  (display-line-numbers-mode 1)
  (setq display-line-numbers 'relative))
(add-hook 'prog-mode-hook 'jh/ide-init)
#+end_src

** Packages
*** LSP Mode
LSP Mode lets me get completion for functions and such in code. From the emacs-for-scratch youtube series.
**** Setup
#+begin_src elisp
(defun jh/lsp-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))
#+end_src

**** Package Setup
#+begin_src elisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((prog-mode . lsp-mode))
  :init 
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))
#+end_src

**** Additional Packages
#+begin_src elisp
(use-package lsp-treemacs
  :after lsp)
#+end_src


*** Projectile
Projectile is a tool for managing projects inside of emacs.
#+begin_src elisp
(use-package projectile
  :config
  (projectile-mode))
#+end_src

*** Magit
Magit is an incredible git client for emacs.

#+begin_src elisp
(use-package magit)

(use-package magit-todos
  :after magit)

(use-package forge
  :after magit)
#+end_src

*** Smartparens
Smartparens inserts a matching delimiter if I insert 1 (like a second parenthesis if I insert a left one).
#+begin_src elisp
(use-package smartparens
  :init
  (smartparens-global-mode))
#+end_src

*** Rainbow Delimiters
Rainbow Delimiters makes it so that parenthesis and other characters have their own colors - making it easier to follow the parenthesis, especially in something like lisp where there are so many parenthesis.
#+begin_src elisp
(use-package rainbow-delimiters
  :hook ((prog-mode) . rainbow-delimiters-mode))
#+end_src

** Language Configuration
*** BibTex/LaTeX
This is for working with my bibliography.
**** Company Backends
#+begin_src elisp
(use-package company-bibtex
  :config
  (add-to-list 'company-backends '(company-bibtex)))
#+end_src

*** Python 
Python is my primary language of choice.
#+begin_src elisp
(use-package python
  :straight nil
  :ensure nil)
#+end_src
**** LSP
#+begin_src elisp
(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred

#+end_src

*** Web Development (HTML, CSS, JavaScript)
**** Company Backends
#+begin_src elisp

#+end_src

**** Emmet
Emmet is a package (built-in to VSCode) that makes editing html so much easier.
#+begin_src elisp
(use-package emmet-mode
  :hook ((sgml-mode css-mode mhtml-mode)))
#+end_src

**** Tailwind LSP
#+begin_src elisp
(use-package lsp-tailwindcss
  :init
  (setq lsp-tailwindcss-add-on-mode t))
#+end_src

**** Lorem Ipsum
The classic text, now in emacs.
#+begin_src elisp
(use-package lorem-ipsum)
#+end_src


**** Simple HTTPD
This lets me build a basic webserver to test my files.
#+begin_src elisp
(use-package simple-httpd)
#+end_src

*** Yaml
#+begin_src elisp
(use-package yaml-mode)
#+end_src



* Applications
** Chat (ERC)
ERC is an IRC client built into emacs.
#+begin_src elisp
(use-package erc
  :ensure nil
  :straight nil)
#+end_src

*** Wrapper for Client
Since I mostly use =emacsclient= for my work, I want to be able to quickly connect to my bitlbee server and launch that way.

** File Manager (Ranger Dired)
I normally use ranger as my terminal file manager, but now I'd like to use ranger in dired.
#+begin_src elisp
(use-package dired-ranger)
#+end_src

** RSS Reader (Elfeed)
Elfeed is an excellent rss reader.
#+begin_src elisp
(use-package elfeed
  :config
  (setq elfeed-db-directory "~/.elfeed/"
	      elfeed-search-filter "@1-week-ago +unread ")
   (evil-define-key 'normal elfeed-search-mode-map 
    "A" 'elfeed-mark-all-as-read
    "Q" 'delete-frame
    "f" 'jh/elfeed-search-hydra/body
    "/" 'elfeed-search-live-filter))

(defun elfeed-mark-all-as-read ()
	(interactive)
  (mark-whole-buffer)
  (elfeed-search-untag-all-unread))

(add-hook 'emacs-startup-hook (lambda () (run-at-time (* 60 5) 'elfeed-update)))
#+end_src

*** Elfeed Org
#+begin_src elisp
(use-package elfeed-org
  :after elfeed
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files '("~/Dropbox/org/elfeed.org")))
#+end_src

*** Elfeed Goodies

*** Hydra
#+begin_src elisp
(pretty-hydra-define jh/elfeed-search-hydra (:title (with-faicon "newspaper-o" "Elfeed Filters") :quit-key "q" :color teal)
  ("Category"
   (("d" (elfeed-search-set-filter "@1-week-ago +unread") "Default") 
    ("n" (elfeed-search-set-filter "@1-week-ago +unread +news") "News") 
    ("c" (elfeed-search-set-filter "@1-week-ago +unread +campaign") "Campaigns")  
    ("f" (elfeed-search-set-filter "@1-week-ago +unread +forum") "Forums")  
    ("p" (elfeed-search-set-filter "+podcast") "Podcasts")  
    ("r" (elfeed-search-set-filter "@1-week-ago +unread +reddit") "Reddit")  
    ("b" (elfeed-search-set-filter "@1-week-ago +unread +blog") "Blogs")))) 

#+end_src

** Email Client (Mu4e)
#+begin_src elisp
(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")

(use-package mu4e 
  :ensure nil
  :straight nil
  :config
  (setq mu4e-change-filenames-when-moving t
        mu4e-maildir "~/.local/share/mail/"
        mu4e-get-mail-command "mbsync -a"
        mu4e-update-interval (* 10 60))
  (setq mu4e-contexts
        (list
         ;; Work account
         (make-mu4e-context
          :name "jhilker2"
          :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/jacob.hilker2@gmail.com" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address . "jacob.hilker2@gmail.com")
                  (mu4e-drafts-folder  . "/jacob.hilker2@gmail.com/[Gmail]/Drafts")
                  (mu4e-sent-folder  . "/jacob.hilker2@gmail.com/[Gmail]/Sent Mail")
                  (mu4e-refile-folder  . "/jacob.hilker2@gmail.com/[Gmail]/All Mail")
                  (mu4e-trash-folder  . "/jacob.hilker2@gmail.com/[Gmail]/Trash")))))


)

#+end_src

* UI Packages
** Dashboard
#+begin_src elisp
(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-week-agenda nil
        dashboard-show-shortcuts nil
        dashboard-set-navigator t
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-items '((recents  . 5)
                          (projects . 10))))
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

** Modeline
Doom modeline allows me to have a cleaner modeline.

#+begin_src elisp
(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :after mu4e-alert
  :config
  (setq doom-modeline-height 32
        doom-modeline-enable-word-count t
        doom-modeline-icon (display-graphic-p)
        doom-modeline-mu4e t
        doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode)
        doom-modeline--battery-status t))

(doom-modeline-mode 1)
#+end_src
*** TODO Custom Modeline
#+begin_src elisp
#+end_src

** Tabs
I really like centaur-tabs for my config.
#+begin_src elisp
(use-package centaur-tabs
  :init
  (centaur-tabs-mode t)
  :config
  (setq centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "•"
	      centaur-tabs-set-icons t
	      centaur-tabs-set-close-button t
	      centaur-tabs-close-button "x"
	      centaur-tabs-style "bar"
        centaur-tabs-set-bar 'above
	      centaur-tabs-cycle-scope 'tabs)
  :hook
  (mu4e-main-mode . centaur-tabs-local-mode)
  (mu4e-headers-mode . centaur-tabs-local-mode) 
  (mu4e-view-mode . centaur-tabs-local-mode)
  (elfeed-search-mode . centaur-tabs-local-mode)
  (org-agenda-mode . centaur-tabs-local-mode)
  :bind
  (:map evil-normal-state-map
	      ("g t" . centaur-tabs-forward)
	      ("g T" . centaur-tabs-backward)))
#+end_src

* Functions
This section contains functions I have created that don't really fit in any other section.
** File Functions
*** Edit Dotfile
This function lets me load my config so that I can edit it.
#+begin_src elisp
(defun edit-dotfile ()
  "Loads the Jmacs config file to be edited."
  (interactive)
  (find-file (expand-file-name "jmacs.org" user-emacs-directory)))
#+end_src

*** Edit Inbox
This function quickly lets me edit my inbox.
#+begin_src elisp
(defun edit-inbox ()
  "Loads the inbox to be reviewed."
  (interactive)
  (find-file "~/Dropbox/org/inbox.org")
  (find-file "~/Dropbox/org/orgzly.org"))
  
#+end_src

** Config Functions
*** Reload Jmacs
#+begin_src elisp
(defun reload-jmacs ()
  "Reloads the config."
  (interactive)
  (org-babel-load-file (expand-file-name "jmacs.org" user-emacs-directory)))
#+end_src

#+RESULTS:
: reload-jmacs

** Startup Functions
*** Display Battery
*** Languages 
**** Org-mode
#+begin_src elisp

#+end_src

* Keybindings
This section serves to describe the keybindings of Jmacs.
