emacs/.config/jmacs/jmacs.el

(add-hook 'org-mode-hook (lambda ()
                           (setq jh/hydra-title (with-fileicon "org" "Org-mode" 1 -0.05))))

(major-mode-hydra-define org-mode (:title jh/hydra-title)
  ("Agenda"
   (("aa" org-agenda "Agenda Dispatch"))
   "Dates"
   (("dd" org-deadline "Set Deadline")
    ("ds" org-schedule "Set Scheduled Date")
    ("dt" org-time-stamp "Set Time Stamp"))))

(defun jh/ide-init ()
  "Initializes Emacs for when I am programming."
  (interactive)
  (global-hl-todo-mode 1)
  (display-line-numbers-mode 1)
  (setq display-line-numbers 'relative))
(add-hook 'prog-mode-hook 'jh/ide-init)

(defun jh/lsp-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((prog-mode . lsp-mode))
  :init 
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-treemacs
  :after lsp)

(use-package projectile
  :config
  (projectile-mode))

(use-package magit)

(use-package magit-todos
  :after magit)

(use-package forge
  :after magit)

(use-package smartparens
  :init
  (smartparens-global-mode))

(use-package rainbow-delimiters
  :hook ((prog-mode) . rainbow-delimiters-mode))

(use-package company-bibtex
  :config
  (add-to-list 'company-backends '(company-bibtex)))

(use-package python
  :straight nil
  :ensure nil)



(use-package emmet-mode
  :hook ((sgml-mode css-mode mhtml-mode)))

(use-package lsp-tailwindcss
  :init
  (setq lsp-tailwindcss-add-on-mode t))

(use-package lorem-ipsum)

(use-package simple-httpd)

(use-package yaml-mode)

(use-package erc
  :ensure nil
  :straight nil)

(use-package dired-ranger)

(use-package elfeed
  :config
  (setq elfeed-db-directory "~/.elfeed/"
	      elfeed-search-filter "@1-week-ago +unread ")
   (evil-define-key 'normal elfeed-search-mode-map 
    "A" 'elfeed-mark-all-as-read
    "Q" 'delete-frame
    "f" 'jh/elfeed-search-hydra/body
    "/" 'elfeed-search-live-filter))

(defun elfeed-mark-all-as-read ()
	(interactive)
  (mark-whole-buffer)
  (elfeed-search-untag-all-unread))

(add-hook 'emacs-startup-hook (lambda () (run-at-time (* 60 5) 'elfeed-update)))

(use-package elfeed-org
  :after elfeed
  :config
  (elfeed-org)
  (setq rmh-elfeed-org-files '("~/Dropbox/org/elfeed.org")))

(pretty-hydra-define jh/elfeed-search-hydra (:title (with-faicon "newspaper-o" "Elfeed Filters") :quit-key "q" :color teal)
  ("Category"
   (("d" (elfeed-search-set-filter "@1-week-ago +unread") "Default") 
    ("n" (elfeed-search-set-filter "@1-week-ago +unread +news") "News") 
    ("c" (elfeed-search-set-filter "@1-week-ago +unread +campaign") "Campaigns")  
    ("f" (elfeed-search-set-filter "@1-week-ago +unread +forum") "Forums")  
    ("p" (elfeed-search-set-filter "+podcast") "Podcasts")  
    ("r" (elfeed-search-set-filter "@1-week-ago +unread +reddit") "Reddit")  
    ("b" (elfeed-search-set-filter "@1-week-ago +unread +blog") "Blogs"))))

(add-to-list 'load-path "/usr/share/emacs/site-lisp/mu4e")

(use-package mu4e 
  :ensure nil
  :straight nil
  :config
  (setq mu4e-change-filenames-when-moving t
        mu4e-maildir "~/.local/share/mail/"
        mu4e-get-mail-command "mbsync -a"
        mu4e-update-interval (* 10 60))
  (setq mu4e-contexts
        (list
         ;; Work account
         (make-mu4e-context
          :name "jhilker2"
          :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/jacob.hilker2@gmail.com" (mu4e-message-field msg :maildir))))
          :vars '((user-mail-address . "jacob.hilker2@gmail.com")
                  (mu4e-drafts-folder  . "/jacob.hilker2@gmail.com/[Gmail]/Drafts")
                  (mu4e-sent-folder  . "/jacob.hilker2@gmail.com/[Gmail]/Sent Mail")
                  (mu4e-refile-folder  . "/jacob.hilker2@gmail.com/[Gmail]/All Mail")
                  (mu4e-trash-folder  . "/jacob.hilker2@gmail.com/[Gmail]/Trash")))))


)

(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-week-agenda nil
        dashboard-show-shortcuts nil
        dashboard-set-navigator t
        dashboard-set-heading-icons t
        dashboard-set-file-icons t
        dashboard-items '((recents  . 5)
                          (projects . 10))))
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))

(use-package doom-modeline
  :hook (after-init . doom-modeline-mode)
  :after mu4e-alert
  :config
  (setq doom-modeline-height 32
        doom-modeline-enable-word-count t
        doom-modeline-icon (display-graphic-p)
        doom-modeline-mu4e t
        doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode)
        doom-modeline--battery-status t))

(doom-modeline-mode 1)



(use-package centaur-tabs
  :init
  (centaur-tabs-mode t)
  :config
  (setq centaur-tabs-set-modified-marker t
        centaur-tabs-modified-marker "•"
	      centaur-tabs-set-icons t
	      centaur-tabs-set-close-button t
	      centaur-tabs-close-button "x"
	      centaur-tabs-style "bar"
        centaur-tabs-set-bar 'above
	      centaur-tabs-cycle-scope 'tabs)
  :hook
  (mu4e-main-mode . centaur-tabs-local-mode)
  (mu4e-headers-mode . centaur-tabs-local-mode) 
  (mu4e-view-mode . centaur-tabs-local-mode)
  (elfeed-search-mode . centaur-tabs-local-mode)
  (org-agenda-mode . centaur-tabs-local-mode)
  :bind
  (:map evil-normal-state-map
	      ("g t" . centaur-tabs-forward)
	      ("g T" . centaur-tabs-backward)))

(defun edit-dotfile ()
  "Loads the Jmacs config file to be edited."
  (interactive)
  (find-file (expand-file-name "jmacs.org" user-emacs-directory)))

(defun edit-inbox ()
  "Loads the inbox to be reviewed."
  (interactive)
  (find-file "~/Dropbox/org/inbox.org")
  (find-file "~/Dropbox/org/orgzly.org"))

(defun reload-jmacs ()
  "Reloads the config."
  (interactive)
  (org-babel-load-file (expand-file-name "jmacs.org" user-emacs-directory)))
