emacs/.config/jmacs/jmacs.org
** Leader Keys
Since I am using evil-mode, and I don’t want to repeat my keybindings, I’m defining my prefix here.
#+begin_src elisp
(general-create-definer jh/evil-leader
  :states '(normal visual insert emacs)
  :prefix "SPC"
  :non-normal-prefix "C-SPC")

(general-create-definer jh/evil-local-leader
  :states '(normal visual insert emacs)
  :prefix ","
  :non-normal-prefix "C-,")
#+end_src

** General Keybindings
These are the core keybindings for functionality in jmacs. In addition, I want to use =SPC h F= for describing a face.
#+begin_src elisp

(jh/evil-leader
  "SPC" '(execute-extended-command :which-key "Run Command")
  "c"   (general-simulate-key "C-c" :which-key "Run `C-c`")
  "h"   (general-simulate-key "C-h" :which-key "Help")
  "u"   (general-simulate-key "C-u" :which-key "Run `C-u`")
  "x"   (general-simulate-key "C-x" :which-key "Run `C-x`"))
#+end_src

** Application Keybindings

** Buffer Keybindings
These keybindings are for switching buffers.
#+begin_src elisp
(jh/evil-leader
  "b"   '(:ignore t :which-key "Buffers")
  "bb"  'mode-line-other-buffer
  "bd"  'kill-this-buffer
  "bn"  'next-buffer
  "bp"  'previous-buffer
  "bq"  'kill-buffer-and-window
  "bR"  'rename-buffer
  "br"  'revert-buffer
  "bs" 'switch-to-buffer)
#+end_src

** File Keybindings
These are my keybindings for files.
#+begin_src elisp
(jh/evil-leader
  "f" '(:ignore t :which-key "Files")
  "fe" '(:ignore t :which-key "Edit File")
  "fed" '(edit-dotfile :which-key "Edit config")
  "fei" '(edit-inbox :which-key "Edit inbox")
  "fer" '(reload-jmacs :which-key "Reload Jmacs")
  "ff" '(find-file :which-key "Find file")
  "fs" '(save-buffer :which-key "Save file")
  "fl" '(load-file :which-key "Load file"))
#+end_src

** Git Keybindings
#+begin_src elisp
(jh/evil-leader
  "g" '(:ignore t :which-key "Magit")
  "gs" 'magit-status
  "gS" 'magit-stage-file
  "gc" 'magit-commit
  "gp" 'magit-pull
  "gP" 'magit-push
  "gb" 'magit-branch
  "gB" 'magit-blame
  "gd" 'magit-diff)
#+end_src

** Help Bindings
#+begin_src elisp
(global-set-key (kbd "C-h F") 'describe-face)
(global-set-key (kbd "C-h f") 'describe-function)

#+end_src

** Insert Keybindings
#+begin_src elisp
(jh/evil-leader
  "i" '(:ignore t :which-key "Insert special character")
  "ic" '(insert-char :which-key "Insert character")
  "ii" '(all-the-icons-insert :which-key "Insert icon")
  "ie" '(emojify-insert-emoji :which-key "Insert emoji")
  "is" '(yas-insert-snippet :which-key "Insert snippet"))
#+end_src

** Org-Mode Bindings
These are my general org-mode bindings.
#+begin_src elisp
(jh/evil-leader
  "o" '(:ignore t :which-key "Org-mode")
  "oa" '(org-agenda :which-key "Org Agenda")
  "ob" '(org-babel-tangle :which-key "tangle source code")
  "oc" '(org-capture :which-key "Org Capture")
  "od" '(:ignore t :which-key "Set Date")
  "odd" '(org-deadline :which-key "Set deadline")
  "ods" '(org-schedule :which-key "Schedule date")
  "odt" '(org-time-stamp :which-key "Set date")
  "oe" '(org-export-dispatch :which-key "Export file")
  "oi" '(:ignore t :which-key "Insert")
  "oil" '(org-insert-link :which-key "Insert link")
  "or" '(jh/org-refile-hydra/body :which-key "Refile Headline")
  "oq" '(org-set-tags-command :which-key "Set tags"))

(jh/evil-local-leader
  :keymaps 'org-mode-map
  "a" '(org-archive-subtree :which-key "Archive Item")
  "r" '(jh/org-refile-hydra/body :which-key "Refile Item"))
#+end_src

** Project Keybindings
#+begin_src elisp
(jh/evil-leader
"p" '(:ignore t :which-key "Project")
"pc" '(projectile-invalidate-cache :which-key "Clear project cache")
"pp" '(projectile-switch-project :which-key "Switch project"))
#+end_src

** Reload Bindings
#+begin_src elisp
(jh/evil-leader
  "r" '(:ignore t :which-key "Reload")
  "rr" '(reload-jmacs :which-key "Reload Jmacs"))
#+end_src



** Search Keybindings
These Keybindings are for searching through various things.
#+begin_src elisp

#+end_src

** Toggle Keybindings
#+begin_src elisp
(jh/evil-leader
  "t" '(:ignore t :which-key "Toggle")
  ;"te" '(global-emojify-mode :which-key "Toggle emoji")
  "ts" '(treemacs :which-key "Toggle Treemacs")
  "to" '(imenu-list :which-key "Toggle Outline")
  "tz" '(writeroom-mode :which-key "Toggle Zen"))
#+end_src

** Window Keybindings
#+begin_src elisp
(jh/evil-leader
  "w"  '(:ignore t :which-key "Windows")
  "w-" '(split-window-right :which-key "Horizontal split")
  "w|" '(split-window-below :which-key "Vertical split")
  "wd"  '(delete-window :which-key "Delete window")
  "wD"  '(delete-other-windows :which-key "Delete other windows")
  "wm" '(maximize-window :which-key "Maximize window")
  "wh" '(evil-window-left :which-key "Move focus left")
  "wj" '(evil-window-down :which-key "Move focus down")
  "wk" '(evil-window-up :which-key "Move focus up")
  "wl" '(evil-window-right :which-key "Move focus right"))
#+end_src


** Quit Keybindings
#+begin_src elisp
(jh/evil-leader
  "q"  '(:ignore t :which-key "Quit")
  "qf" '(delete-frame :which-key "Kill Frame")
  "qq" '(kill-emacs :which-key "Quit emacs")
  "qr" '(restart-emacs :which-key "Restart emacs"))
#+end_src

** Zoom In and Out
You can use Control plus = and Control plus - to zoom in and out like everywhere else. 
#+begin_src elisp
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
#+end_src

* Load Custom File
#+begin_src elisp
(when (file-exists-p custom-file)
  (load custom-file))
#+end_src




